-- id		stt			edt
-- 1001,'2022-05-03','2022-05-08'
-- 1001,'2022-05-10','2022-05-15'
-- 1002,'2022-05-03','2022-05-10'
-- 1002,'2022-05-08','2022-05-15'
-- 1003,'2022-05-03','2022-05-20'
-- 1003,'2022-05-08','2022-05-15'
-- 1003,'2022-05-17','2022-05-25'
-- 1004,'2022-05-03','2022-05-20'
-- 1004,'2022-05-08','2022-05-17'
-- 1004,'2022-05-15','2022-05-25'

-- 上述每条数据为某个品牌做活动的开始与结束时间
-- 计算每个品牌总的做活动的时间。
-- 注意时间上有交叉,同一个品牌同一天如果有多个活动,活动时间只记录一天！
-- 比如1002在 8,9,10 这三天都是两个活动,计算天数时只计算一次
-- 1001	12
-- 1002	13
-- 1003	23
-- 1004	23


select
id,
sum(`if`(edt<st,0,datediff(edt,st)+1))
from
(
    select
    id,
    `if`(tmpdt is null ,stt,`if`(stt>tmpdt,stt,date_add(tmpdt,1))) st,
    edt
    from
    (
        select
            id,
            stt,
            edt,
            max(edt)over (partition by id order by stt rows between unbounded preceding and 1 preceding ) tmpdt
        from test3
    )t1
)t2
group by id;
